Revit 2020 API
ProjectLocation.GetProjectPosition Method
 Gets the coordinates of a point in the ProjectLocation's coordinate system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Syntax
C#
public ProjectPosition GetProjectPosition(
	XYZ point
)
Visual Basic
Public Function GetProjectPosition ( _
	point As XYZ _
) As ProjectPosition
Visual C++
public:
ProjectPosition^ GetProjectPosition(
	XYZ^ point
)
Parameters
point
Type: Autodesk.Revit.DB.XYZ
Remarks
When getting this value, the North/South, East/West, and Elevation values report the coordinates of the point similar to the Revit command "Report Shared Coordinates". To get the values of the transformations applied by this project location, pass XYZ.Zero.
If the project has acquired shared coordinates from a linked model, the shared coordinate transformation will be reflected in the coordinates of the transformed point returned by this property.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.InvalidOperationException |  Unable to use the project position's transform to calculate the point.
See Also
ProjectLocation Class
Autodesk.Revit.DB Namespace